"""
Задача:
Дана функция s: В результате каких вызовов данная функция вернет число 31?

Выберите все подходящие ответы из списка
s(11, 10, 10)
s(0, 0, 31)
s(11, 10, b=10) # True
s(b=31, 0)
s(b=31)
s(21) # True
s(11, 10) # True
s(5, 5, 5, 5, 1) # True
s(11, b=20) # True
"""

def s(a, *vs, b=10):
   res = a + b
   for v in vs:
       res += v
   return res

print("s(11, 10, 10)" if s(11, 10, 10) == 31 else "")
print("s(0, 0, 31)" if s(0, 0, 31) == 31 else "")
print("s(11, 10, b=10)" if s(11, 10, b=10) == 31 else "")
print("s(21)" if s(21) == 31 else "")
print("s(11, 10)" if s(11, 10) == 31 else "")
print("s(5, 5, 5, 5, 1)" if s(5, 5, 5, 5, 1) == 31 else "")
print("s(11, b=20)" if s(11, b=20) == 31 else "")
