"""
Задача:
Тимофей обычно спит ночью X часов и устраивает себе днем тихий час на Y минут.
Определите, сколько всего минут Тимофей спит в сутки.

Обратите внимание на то, что приглашение, переданное в качестве аргумента в функцию
input, считается выводом вашей программы. Используйте эту функцию без аргументов:
values = input() без строки приглашения!

Sample Input 1:
7
30
Sample Output 1:
450
"""

print(int(input()) * 60 + int(input()))